# Terraform plan

## lab01

```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_instance.vm will be created
  + resource "aws_instance" "vm" {
      + ami                                  = (sensitive value)
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + enable_primary_ipv6                  = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_lifecycle                   = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t3.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = (known after apply)
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + spot_instance_request_id             = (known after apply)
      + subnet_id                            = (known after apply)
      + tags                                 = {
          + "Lab"     = "lab01"
          + "Name"    = "iac-lab01-vm"
          + "Project" = "IAC-Labs"
        }
      + tags_all                             = {
          + "Lab"     = "lab01"
          + "Name"    = "iac-lab01-vm"
          + "Project" = "IAC-Labs"
        }
      + tenancy                              = (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = (known after apply)

      + capacity_reservation_specification (known after apply)

      + cpu_options (known after apply)

      + ebs_block_device (known after apply)

      + enclave_options (known after apply)

      + ephemeral_block_device (known after apply)

      + instance_market_options (known after apply)

      + maintenance_options (known after apply)

      + metadata_options (known after apply)

      + network_interface (known after apply)

      + private_dns_name_options (known after apply)

      + root_block_device (known after apply)
    }

  # aws_internet_gateway.igw_lab01 will be created
  + resource "aws_internet_gateway" "igw_lab01" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Lab"     = "lab01"
          + "Name"    = "iac-lab01-igw"
          + "Project" = "IAC-Labs"
        }
      + tags_all = {
          + "Lab"     = "lab01"
          + "Name"    = "iac-lab01-igw"
          + "Project" = "IAC-Labs"
        }
      + vpc_id   = (known after apply)
    }

  # aws_route_table.public_route_lab01 will be created
  + resource "aws_route_table" "public_route_lab01" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + cidr_block                 = "0.0.0.0/0"
              + gateway_id                 = (known after apply)
                # (11 unchanged attributes hidden)
            },
        ]
      + tags             = {
          + "Lab"     = "lab01"
          + "Name"    = "iac-lab01-rtb-public"
          + "Project" = "IAC-Labs"
        }
      + tags_all         = {
          + "Lab"     = "lab01"
          + "Name"    = "iac-lab01-rtb-public"
          + "Project" = "IAC-Labs"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table_association.public_assoc_lab01 will be created
  + resource "aws_route_table_association" "public_assoc_lab01" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_security_group.ssh will be created
  + resource "aws_security_group" "ssh" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
                # (1 unchanged attribute hidden)
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + from_port        = 22
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 22
                # (1 unchanged attribute hidden)
            },
        ]
      + name                   = "iac-lab01-ssh"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Lab"     = "lab01"
          + "Project" = "IAC-Labs"
        }
      + tags_all               = {
          + "Lab"     = "lab01"
          + "Project" = "IAC-Labs"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_subnet.public_subnet_lab01 will be created
  + resource "aws_subnet" "public_subnet_lab01" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-north-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.10.1.0/26"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Lab"     = "lab01"
          + "Name"    = "iac-lab01-public-a"
          + "Project" = "IAC-Labs"
        }
      + tags_all                                       = {
          + "Lab"     = "lab01"
          + "Name"    = "iac-lab01-public-a"
          + "Project" = "IAC-Labs"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_vpc.vpc_lab01 will be created
  + resource "aws_vpc" "vpc_lab01" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.10.1.0/24"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_dns_hostnames                 = (known after apply)
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Lab"     = "lab01"
          + "Name"    = "iac-lab01-vpc"
          + "Project" = "IAC-Labs"
        }
      + tags_all                             = {
          + "Lab"     = "lab01"
          + "Name"    = "iac-lab01-vpc"
          + "Project" = "IAC-Labs"
        }
    }

Plan: 7 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + instance_id         = (known after apply)
  + instance_public_dns = (known after apply)
  + instance_public_ip  = (known after apply)
  + subnet_id           = (known after apply)
  + vpc_id              = (known after apply)
```

<!-- Sticky Pull Request Commenttf-plan -->